loadtest.yml
config:
  target: "http://20.150.154.243:8050"
  phases:
    - duration: 5
      arrivalRate: 1000
      name: "EASY"
    - duration: 5
      arrivalRate: 2000
      name: "MEDIUM"
    - duration: 30
      arrivalRate: 10000
      name: "HARD"
scenarios:
  - flow:
      - get:
          url: "/articles"
      - think: 2