loadtest.yml
config:
  target: "http://capnews.com"
  phases:
    - duration: 5
      arrivalRate: 400
      name: "EASY"
    - duration: 5
      arrivalRate: 800
      name: "MEDIUM"
    - duration: 5
      arrivalRate: 1200
      name: "HARD"
scenarios:
  - flow:
      - get:
          url: "/articles"
      - think: 2